# 函数
#作用，就是具有特定功能的代码块，比如，登录，注册
# def + 函数名（参数1，参数2.。。。。）：
#     函数的代码块
#函数名： 起函数的名字的时候，一定要有语义。
#return：返回函数，默认return None . 起到的对函数结束的标志。
# 参数类型：
# 位置参数：参数的数量和位置是有顺序的，在调用的时候，参数的数量和顺序要一致
# 关键字参数： 函数调用时，是由key:walue形式进行传递，add(x=3,y=4)
# 默认参数; 有的参数可以指定默认值，默认值的参数需要放在最后面。
# add(x,y=4)
#可变参数： 包括列表形式的可变参数，和字典形式的可变参数：add(x,y,*args)
#字典形式 add(x,y,**args)

#面向对象
#它是一种编程思想，就是把现实生活中的事物抽象成为具体的类，
# 在类中申明属性和方法，再去初始化对象
#class 类
#  变量 = None
#   def 方法（self）：
#       代码块
#   c =类名
#   c.方法（）
# 构造方法：
# def __unit__():
#        代码块（初始化数据）











